<a href="https://colab.research.google.com/github/Matheus-Homem/Matheus-Homem/blob/main/Data_Cleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Cleaning Notebook
For more information about each column of each dataset, visit [this link](https://github.com/Matheus-Homem/customer-segmentation-project/blob/main/data/description.md).

## 1. Imports

In [528]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

In [529]:
customer    = pd.read_csv('https://raw.githubusercontent.com/Matheus-Homem/customer-segmentation-project/main/data/olist_customers_dataset.csv')
items       = pd.read_csv('https://github.com/Matheus-Homem/customer-segmentation-project/blob/main/data/olist_order_items_dataset.csv?raw=true')
payments    = pd.read_csv('https://github.com/Matheus-Homem/customer-segmentation-project/blob/main/data/olist_order_payments_dataset.csv?raw=true')
reviews     = pd.read_csv('https://github.com/Matheus-Homem/customer-segmentation-project/blob/main/data/olist_order_reviews_dataset.csv?raw=true')
orders      = pd.read_csv('https://github.com/Matheus-Homem/customer-segmentation-project/blob/main/data/olist_orders_dataset.csv?raw=true')
products    = pd.read_csv('https://github.com/Matheus-Homem/customer-segmentation-project/blob/main/data/olist_products_dataset.csv?raw=true')
sellers     = pd.read_csv('https://raw.githubusercontent.com/Matheus-Homem/customer-segmentation-project/main/data/olist_sellers_dataset.csv')

## 2. Preview + Merging

### Datasets Preview

#### Customer Dataset

In [530]:
customer.head()

                        customer_id  ... customer_state
0  06b8999e2fba1a1fbc88172c00ba8bc7  ...             SP
1  18955e83d337fd6b2def6b18a428ac77  ...             SP
2  4e7b3e00288586ebd08712fdd0374a03  ...             SP
3  b2b6027bc5c5109e529d4dc6358b12c3  ...             SP
4  4f2d8ab171c80ec8364f7c12e35b23ad  ...             SP

[5 rows x 5 columns]

In [531]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 5 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               99441 non-null  object
 1   customer_unique_id        99441 non-null  object
 2   customer_zip_code_prefix  99441 non-null  int64
 3   customer_city             99441 non-null  object
 4   customer_state            99441 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.8+ MB

#### Items Dataset

In [532]:
items.head()

                           order_id  order_item_id  ...   price freight_value
0  00010242fe8c5a6d1ba2dd792cb16214              1  ...   58.90         13.29
1  00018f77f2f0320c557190d7a144bdd3              1  ...  239.90         19.93
2  000229ec398224ef6ca0657da4fc703e              1  ...  199.00         17.87
3  00024acbcdf0a6daa1e931b038114c75              1  ...   12.99         12.79
4  00042b26cf59d7ce69dfabb4e55b4fd9              1  ...  199.90         18.14

[5 rows x 7 columns]

In [533]:
items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112650 entries, 0 to 112649
Data columns (total 7 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   order_id             112650 non-null  object
 1   order_item_id        112650 non-null  int64
 2   product_id           112650 non-null  object
 3   seller_id            112650 non-null  object
 4   shipping_limit_date  112650 non-null  object
 5   price                112650 non-null  float64
 6   freight_value        112650 non-null  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 6.0+ MB

#### Payments Dataset

In [534]:
payments.head()

                           order_id  ...  payment_value
0  b81ef226f3fe1789b1e8b2acac839d17  ...          99.33
1  a9810da82917af2d9aefd1278f1dcfa0  ...          24.39
2  25e8ea4e93396b6fa0d3dd708e76c1bd  ...          65.71
3  ba78997921bbcdc1373bb41e913ab953  ...         107.78
4  42fdf880ba16b47b59251dd489d4441a  ...         128.45

[5 rows x 5 columns]

In [535]:
payments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103886 entries, 0 to 103885
Data columns (total 5 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   order_id              103886 non-null  object
 1   payment_sequential    103886 non-null  int64
 2   payment_type          103886 non-null  object
 3   payment_installments  103886 non-null  int64
 4   payment_value         103886 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.0+ MB

#### Review Dataset

In [536]:
reviews.head()

                          review_id  ... review_answer_timestamp
0  7bc2406110b926393aa56f80a40eba40  ...     2018-01-18 21:46:59
1  80e641a11e56f04c1ad469d5645fdfde  ...     2018-03-11 03:05:13
2  228ce5500dc1d8e020d8d1322874b6f0  ...     2018-02-18 14:36:24
3  e64fb393e7b32834bb789ff8bb30750e  ...     2017-04-21 22:02:06
4  f7c4243c7fe1938f181bec41a392bdeb  ...     2018-03-02 10:26:53

[5 rows x 7 columns]

In [537]:
reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 7 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   review_id                100000 non-null  object
 1   order_id                 100000 non-null  object
 2   review_score             100000 non-null  int64
 3   review_comment_title     11715 non-null   object
 4   review_comment_message   41753 non-null   object
 5   review_creation_date     100000 non-null  object
 6   review_answer_timestamp  100000 non-null  object
dtypes: int64(1), object(6)
memory usage: 5.3+ MB

#### Orders Dataset

In [538]:
orders.head()

                           order_id  ... order_estimated_delivery_date
0  e481f51cbdc54678b7cc49136f2d6af7  ...           2017-10-18 00:00:00
1  53cdb2fc8bc7dce0b6741e2150273451  ...           2018-08-13 00:00:00
2  47770eb9100c2d0c44946d9cf07ec65d  ...           2018-09-04 00:00:00
3  949d5b44dbf5de918fe9c16f97b45f8a  ...           2017-12-15 00:00:00
4  ad21c59c0840e6cb83a9ceb5573f8159  ...           2018-02-26 00:00:00

[5 rows x 8 columns]

In [539]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 8 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   order_id                       99441 non-null  object
 1   customer_id                    99441 non-null  object
 2   order_status                   99441 non-null  object
 3   order_purchase_timestamp       99441 non-null  object
 4   order_approved_at              99281 non-null  object
 5   order_delivered_carrier_date   97658 non-null  object
 6   order_delivered_customer_date  96476 non-null  object
 7   order_estimated_delivery_date  99441 non-null  object
dtypes: object(8)
memory usage: 6.1+ MB

#### Products Dataset

In [540]:
products.head()

                         product_id  ... product_width_cm
0  1e9e8ef04dbcff4541ed26657ea517e5  ...             14.0
1  3aa071139cb16b67ca9e5dea641aaa2f  ...             20.0
2  96bd76ec8810374ed1b65e291975717f  ...             15.0
3  cef67bcfe19066a932b7673e239eb23d  ...             26.0
4  9dc1a7de274444849c219cff195d0b71  ...             13.0

[5 rows x 9 columns]

In [541]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32951 entries, 0 to 32950
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   product_id                  32951 non-null  object
 1   product_category_name       32341 non-null  object
 2   product_name_lenght         32341 non-null  float64
 3   product_description_lenght  32341 non-null  float64
 4   product_photos_qty          32341 non-null  float64
 5   product_weight_g            32949 non-null  float64
 6   product_length_cm           32949 non-null  float64
 7   product_height_cm           32949 non-null  float64
 8   product_width_cm            32949 non-null  float64
dtypes: float64(7), object(2)
memory usage: 2.3+ MB

#### Sellers Dataset

In [542]:
sellers.head()

                          seller_id  ...  seller_state
0  3442f8959a84dea7ee197c632cb2df15  ...            SP
1  d1b65fc7debc3361ea86b5f14c68d2e2  ...            SP
2  ce3ad9de960102d0677a81f5d0bb7b2d  ...            RJ
3  c0f3eea2e14555b6faeea3dd58c1b1c3  ...            SP
4  51a04a8a6bdcb23deccc82b0b80742cf  ...            SP

[5 rows x 4 columns]

In [543]:
sellers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3095 entries, 0 to 3094
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   seller_id               3095 non-null   object
 1   seller_zip_code_prefix  3095 non-null   int64
 2   seller_city             3095 non-null   object
 3   seller_state            3095 non-null   object
dtypes: int64(1), object(3)
memory usage: 96.8+ KB

### Merging Dataframes

#### Orders + Payments

In [544]:
payments.groupby('order_id').payment_value.sum().reset_index()

                               order_id  payment_value
0      00010242fe8c5a6d1ba2dd792cb16214          72.19
1      00018f77f2f0320c557190d7a144bdd3         259.83
2      000229ec398224ef6ca0657da4fc703e         216.87
3      00024acbcdf0a6daa1e931b038114c75          25.78
4      00042b26cf59d7ce69dfabb4e55b4fd9         218.04
...                                 ...            ...
99435  fffc94f6ce00a00581880bf54a75a037         343.40
99436  fffcd46ef2263f404302a634eb57f7eb         386.53
99437  fffce4705a9662cd70adb13d4a31832d         116.85
99438  fffe18544ffabc95dfada21779c9644f          64.71
99439  fffe41c64501cc87c801fd61db3f6244          55.79

[99440 rows x 2 columns]

In [545]:
orders[['order_id','customer_id','order_status','order_purchase_timestamp','order_delivered_customer_date']]

                               order_id  ... order_delivered_customer_date
0      e481f51cbdc54678b7cc49136f2d6af7  ...           2017-10-10 21:25:13
1      53cdb2fc8bc7dce0b6741e2150273451  ...           2018-08-07 15:27:45
2      47770eb9100c2d0c44946d9cf07ec65d  ...           2018-08-17 18:06:29
3      949d5b44dbf5de918fe9c16f97b45f8a  ...           2017-12-02 00:28:42
4      ad21c59c0840e6cb83a9ceb5573f8159  ...           2018-02-16 18:17:02
...                                 ...  ...                           ...
99436  9c5dedf39a927c1b2549525ed64a053c  ...           2017-03-17 15:08:01
99437  63943bddc261676b46f01ca7ac2f7bd8  ...           2018-02-28 17:37:56
99438  83c1379a015df1e13d02aae0204711ab  ...           2017-09-21 11:24:17
99439  11c177c8e97725db2631073c19f07b62  ...           2018-01-25 23:32:54
99440  66dea50a8b16d9b4dee7af250b4be1a5  ...           2018-03-16 13:08:30

[99441 rows x 5 columns]

In [546]:
orders = pd.merge(orders[['order_id','customer_id','order_status','order_purchase_timestamp','order_delivered_customer_date']],
                  payments.groupby('order_id').payment_value.sum().reset_index(),
                  on='order_id')
orders.head()

                           order_id  ... payment_value
0  e481f51cbdc54678b7cc49136f2d6af7  ...         38.71
1  53cdb2fc8bc7dce0b6741e2150273451  ...        141.46
2  47770eb9100c2d0c44946d9cf07ec65d  ...        179.12
3  949d5b44dbf5de918fe9c16f97b45f8a  ...         72.20
4  ad21c59c0840e6cb83a9ceb5573f8159  ...         28.62

[5 rows x 6 columns]

In [547]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 99440 entries, 0 to 99439
Data columns (total 6 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   order_id                       99440 non-null  object
 1   customer_id                    99440 non-null  object
 2   order_status                   99440 non-null  object
 3   order_purchase_timestamp       99440 non-null  object
 4   order_delivered_customer_date  96475 non-null  object
 5   payment_value                  99440 non-null  float64
dtypes: float64(1), object(5)
memory usage: 5.3+ MB

#### Order + Customer

In [548]:
customer.drop('customer_zip_code_prefix',axis=1)

                            customer_id  ... customer_state
0      06b8999e2fba1a1fbc88172c00ba8bc7  ...             SP
1      18955e83d337fd6b2def6b18a428ac77  ...             SP
2      4e7b3e00288586ebd08712fdd0374a03  ...             SP
3      b2b6027bc5c5109e529d4dc6358b12c3  ...             SP
4      4f2d8ab171c80ec8364f7c12e35b23ad  ...             SP
...                                 ...  ...            ...
99436  17ddf5dd5d51696bb3d7c6291687be6f  ...             SP
99437  e7b71a9017aa05c9a7fd292d714858e8  ...             SP
99438  5e28dfe12db7fb50a4b2f691faecea5e  ...             CE
99439  56b18e2166679b8a959d72dd06da27f9  ...             RS
99440  274fa6071e5e17fe303b9748641082c8  ...             SP

[99441 rows x 4 columns]

In [549]:
orders = pd.merge(orders,
                  customer.drop('customer_zip_code_prefix',axis=1),
                  on='customer_id').drop('customer_id',axis=1)
orders.head()

                           order_id  ... customer_state
0  e481f51cbdc54678b7cc49136f2d6af7  ...             SP
1  53cdb2fc8bc7dce0b6741e2150273451  ...             BA
2  47770eb9100c2d0c44946d9cf07ec65d  ...             GO
3  949d5b44dbf5de918fe9c16f97b45f8a  ...             RN
4  ad21c59c0840e6cb83a9ceb5573f8159  ...             SP

[5 rows x 8 columns]

In [550]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 99440 entries, 0 to 99439
Data columns (total 8 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   order_id                       99440 non-null  object
 1   order_status                   99440 non-null  object
 2   order_purchase_timestamp       99440 non-null  object
 3   order_delivered_customer_date  96475 non-null  object
 4   payment_value                  99440 non-null  float64
 5   customer_unique_id             99440 non-null  object
 6   customer_city                  99440 non-null  object
 7   customer_state                 99440 non-null  object
dtypes: float64(1), object(7)
memory usage: 6.8+ MB

#### Orders + Reviews

In [551]:
reviews = reviews.drop_duplicates(subset=['review_id'])[['order_id','review_score']].drop_duplicates(subset=['order_id'])
reviews.head()

                           order_id  review_score
0  73fc7af87114b39712e6da79b0a377eb             4
1  a548910a1c6147796b98fdf73dbeba33             5
2  f9e4b658b201a9f2ecdecbb34bed034b             5
3  658677c97b385a9be170737859d3511b             5
4  8e6bfb81e283fa7e4f11123a3fb894f1             5

In [552]:
reviews.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 98926 entries, 0 to 99999
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      98926 non-null  object
 1   review_score  98926 non-null  int64
dtypes: int64(1), object(1)
memory usage: 2.3+ MB

In [553]:
orders = pd.merge(orders,reviews,on='order_id',how='outer')
orders.head()

                           order_id order_status  ... customer_state review_score
0  e481f51cbdc54678b7cc49136f2d6af7    delivered  ...             SP          4.0
1  53cdb2fc8bc7dce0b6741e2150273451    delivered  ...             BA          4.0
2  47770eb9100c2d0c44946d9cf07ec65d    delivered  ...             GO          5.0
3  949d5b44dbf5de918fe9c16f97b45f8a    delivered  ...             RN          5.0
4  ad21c59c0840e6cb83a9ceb5573f8159    delivered  ...             SP          5.0

[5 rows x 9 columns]

In [554]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 99441 entries, 0 to 99440
Data columns (total 9 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   order_id                       99441 non-null  object
 1   order_status                   99440 non-null  object
 2   order_purchase_timestamp       99440 non-null  object
 3   order_delivered_customer_date  96475 non-null  object
 4   payment_value                  99440 non-null  float64
 5   customer_unique_id             99440 non-null  object
 6   customer_city                  99440 non-null  object
 7   customer_state                 99440 non-null  object
 8   review_score                   98926 non-null  float64
dtypes: float64(2), object(7)
memory usage: 7.6+ MB

In [555]:
orders = orders[orders.isnull()['order_status']!=True]
orders.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 99440 entries, 0 to 99439
Data columns (total 9 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   order_id                       99440 non-null  object
 1   order_status                   99440 non-null  object
 2   order_purchase_timestamp       99440 non-null  object
 3   order_delivered_customer_date  96475 non-null  object
 4   payment_value                  99440 non-null  float64
 5   customer_unique_id             99440 non-null  object
 6   customer_city                  99440 non-null  object
 7   customer_state                 99440 non-null  object
 8   review_score                   98925 non-null  float64
dtypes: float64(2), object(7)
memory usage: 7.6+ MB

#### Items + Sellers

In [556]:
items = pd.merge(items.drop('shipping_limit_date',axis=1),sellers.drop('seller_zip_code_prefix',axis=1),on='seller_id').drop('seller_id',axis=1)
items.head()

                           order_id  order_item_id  ...    seller_city  seller_state
0  00010242fe8c5a6d1ba2dd792cb16214              1  ...  volta redonda            SP
1  0188777fe321843a18be24a6e9aa1e53              1  ...  volta redonda            SP
2  0191bbb5166d4b9a68df11797d5acfa9              1  ...  volta redonda            SP
3  03054d8a8eefc2981cfad06f58e27979              1  ...  volta redonda            SP
4  0c325ea6925de749e1420be0cf43587c              1  ...  volta redonda            SP

[5 rows x 7 columns]

In [557]:
items.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 112650 entries, 0 to 112649
Data columns (total 7 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   order_id       112650 non-null  object
 1   order_item_id  112650 non-null  int64
 2   product_id     112650 non-null  object
 3   price          112650 non-null  float64
 4   freight_value  112650 non-null  float64
 5   seller_city    112650 non-null  object
 6   seller_state   112650 non-null  object
dtypes: float64(2), int64(1), object(4)
memory usage: 6.9+ MB

#### Items + Products

In [558]:
items = pd.merge(items,products[['product_id','product_category_name']],on='product_id').drop('product_id',axis=1)
items.head()

                           order_id  ...  product_category_name
0  00010242fe8c5a6d1ba2dd792cb16214  ...             cool_stuff
1  130898c0987d1801452a8ed92a670612  ...             cool_stuff
2  532ed5e14e24ae1f0d735b91524b98b9  ...             cool_stuff
3  6f8c31653edb8c83e1a739408b5ff750  ...             cool_stuff
4  7d19f4ef4d04461989632411b7e588b9  ...             cool_stuff

[5 rows x 7 columns]

In [559]:
items.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 112650 entries, 0 to 112649
Data columns (total 7 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   order_id               112650 non-null  object
 1   order_item_id          112650 non-null  int64
 2   price                  112650 non-null  float64
 3   freight_value          112650 non-null  float64
 4   seller_city            112650 non-null  object
 5   seller_state           112650 non-null  object
 6   product_category_name  111047 non-null  object
dtypes: float64(2), int64(1), object(4)
memory usage: 6.9+ MB

In [560]:
print('The Product Category Name variable has {}% of missing values'.format(round((items.isnull().sum()*100/items.shape[0]).loc['product_category_name'],2)))

The Product Category Name variable has 1.42% of missing values

#### Orders + Items

In [561]:
print('The Items Dataset has {} unique order_id values.'.format(items.order_id.nunique()))

The Items Dataset has 98666 unique order_id values.

In [562]:
print('The Orders Dataset has {} unique order_id values.'.format(orders.order_id.nunique()))

The Orders Dataset has 99440 unique order_id values.

In [563]:
items.groupby('order_id').order_item_id.max().reset_index()

                               order_id  order_item_id
0      00010242fe8c5a6d1ba2dd792cb16214              1
1      00018f77f2f0320c557190d7a144bdd3              1
2      000229ec398224ef6ca0657da4fc703e              1
3      00024acbcdf0a6daa1e931b038114c75              1
4      00042b26cf59d7ce69dfabb4e55b4fd9              1
...                                 ...            ...
98661  fffc94f6ce00a00581880bf54a75a037              1
98662  fffcd46ef2263f404302a634eb57f7eb              1
98663  fffce4705a9662cd70adb13d4a31832d              1
98664  fffe18544ffabc95dfada21779c9644f              1
98665  fffe41c64501cc87c801fd61db3f6244              1

[98666 rows x 2 columns]

In [564]:
orders = pd.merge(orders,items.groupby('order_id').order_item_id.max().reset_index(),on='order_id')
orders.head()

                           order_id order_status  ... review_score order_item_id
0  e481f51cbdc54678b7cc49136f2d6af7    delivered  ...          4.0             1
1  53cdb2fc8bc7dce0b6741e2150273451    delivered  ...          4.0             1
2  47770eb9100c2d0c44946d9cf07ec65d    delivered  ...          5.0             1
3  949d5b44dbf5de918fe9c16f97b45f8a    delivered  ...          5.0             1
4  ad21c59c0840e6cb83a9ceb5573f8159    delivered  ...          5.0             1

[5 rows x 10 columns]

In [565]:
orders.shape

(98665, 10)

In [566]:
items.groupby('order_id')[['price','freight_value']].mean().reset_index()

                               order_id   price  freight_value
0      00010242fe8c5a6d1ba2dd792cb16214   58.90          13.29
1      00018f77f2f0320c557190d7a144bdd3  239.90          19.93
2      000229ec398224ef6ca0657da4fc703e  199.00          17.87
3      00024acbcdf0a6daa1e931b038114c75   12.99          12.79
4      00042b26cf59d7ce69dfabb4e55b4fd9  199.90          18.14
...                                 ...     ...            ...
98661  fffc94f6ce00a00581880bf54a75a037  299.99          43.41
98662  fffcd46ef2263f404302a634eb57f7eb  350.00          36.53
98663  fffce4705a9662cd70adb13d4a31832d   99.90          16.95
98664  fffe18544ffabc95dfada21779c9644f   55.99           8.72
98665  fffe41c64501cc87c801fd61db3f6244   43.00          12.79

[98666 rows x 3 columns]

In [567]:
orders = pd.merge(orders,items.groupby('order_id')[['price','freight_value']].mean().reset_index(),on='order_id')
orders.head()

                           order_id order_status  ...   price freight_value
0  e481f51cbdc54678b7cc49136f2d6af7    delivered  ...   29.99          8.72
1  53cdb2fc8bc7dce0b6741e2150273451    delivered  ...  118.70         22.76
2  47770eb9100c2d0c44946d9cf07ec65d    delivered  ...  159.90         19.22
3  949d5b44dbf5de918fe9c16f97b45f8a    delivered  ...   45.00         27.20
4  ad21c59c0840e6cb83a9ceb5573f8159    delivered  ...   19.90          8.72

[5 rows x 12 columns]

In [568]:
items.drop_duplicates('order_id')[['order_id','product_category_name']]

                                order_id product_category_name
0       00010242fe8c5a6d1ba2dd792cb16214            cool_stuff
1       130898c0987d1801452a8ed92a670612            cool_stuff
2       532ed5e14e24ae1f0d735b91524b98b9            cool_stuff
3       6f8c31653edb8c83e1a739408b5ff750            cool_stuff
4       7d19f4ef4d04461989632411b7e588b9            cool_stuff
...                                  ...                   ...
112643  fd607d0a02cb276bc764a15f80f0423f      moveis_decoracao
112645  fdaf98feac227eb978d8f33f36e0231d      moveis_decoracao
112646  fe68b52db13993f58175fa589125d345           eletronicos
112647  fefacc66af859508bf1a7934eab1e97f                   pcs
112648  ff701a7c869ad21de22a6994237c8a00               bebidas

[98666 rows x 2 columns]

In [569]:
orders = pd.merge(orders,items.drop_duplicates('order_id')[['order_id','product_category_name']],on='order_id')
orders.head()

                           order_id  ...  product_category_name
0  e481f51cbdc54678b7cc49136f2d6af7  ...  utilidades_domesticas
1  53cdb2fc8bc7dce0b6741e2150273451  ...             perfumaria
2  47770eb9100c2d0c44946d9cf07ec65d  ...             automotivo
3  949d5b44dbf5de918fe9c16f97b45f8a  ...               pet_shop
4  ad21c59c0840e6cb83a9ceb5573f8159  ...              papelaria

[5 rows x 13 columns]

In [570]:
orders.shape

(98665, 13)

## 3. Finalizing Dataset

In [571]:
orders.head()

                           order_id  ...  product_category_name
0  e481f51cbdc54678b7cc49136f2d6af7  ...  utilidades_domesticas
1  53cdb2fc8bc7dce0b6741e2150273451  ...             perfumaria
2  47770eb9100c2d0c44946d9cf07ec65d  ...             automotivo
3  949d5b44dbf5de918fe9c16f97b45f8a  ...               pet_shop
4  ad21c59c0840e6cb83a9ceb5573f8159  ...              papelaria

[5 rows x 13 columns]

In [572]:
orders.isnull().sum()*100/orders.shape[0]

order_id                         0.000000
order_status                     0.000000
order_purchase_timestamp         0.000000
order_delivered_customer_date    2.219632
payment_value                    0.000000
customer_unique_id               0.000000
customer_city                    0.000000
customer_state                   0.000000
review_score                     0.490549
order_item_id                    0.000000
price                            0.000000
freight_value                    0.000000
product_category_name            1.433132
dtype: float64

### Deleting Missing Values

In [573]:
orders.dropna(inplace=True)

In [574]:
orders.isnull().sum()*100/orders.shape[0]

order_id                         0.0
order_status                     0.0
order_purchase_timestamp         0.0
order_delivered_customer_date    0.0
payment_value                    0.0
customer_unique_id               0.0
customer_city                    0.0
customer_state                   0.0
review_score                     0.0
order_item_id                    0.0
price                            0.0
freight_value                    0.0
product_category_name            0.0
dtype: float64

### Data Types

In [575]:
orders.dtypes

order_id                          object
order_status                      object
order_purchase_timestamp          object
order_delivered_customer_date     object
payment_value                    float64
customer_unique_id                object
customer_city                     object
customer_state                    object
review_score                     float64
order_item_id                      int64
price                            float64
freight_value                    float64
product_category_name             object
dtype: object

In [576]:
orders['order_purchase_timestamp'].head()

0    2017-10-02 10:56:33
1    2018-07-24 20:41:37
2    2018-08-08 08:38:49
3    2017-11-18 19:28:06
4    2018-02-13 21:18:39
Name: order_purchase_timestamp, dtype: object

In [577]:
orders['order_purchase_timestamp'] = orders['order_purchase_timestamp'].astype('datetime64[D]')

In [578]:
orders['order_delivered_customer_date'] = orders['order_delivered_customer_date'].astype('datetime64[D]')

In [581]:
orders['wait_time'] = orders['order_delivered_customer_date'] - orders['order_purchase_timestamp']

In [583]:
orders.dtypes

order_id                                  object
order_status                              object
order_purchase_timestamp          datetime64[ns]
order_delivered_customer_date     datetime64[ns]
payment_value                            float64
customer_unique_id                        object
customer_city                             object
customer_state                            object
review_score                             float64
order_item_id                              int64
price                                    float64
freight_value                            float64
product_category_name                     object
wait_time                        timedelta64[ns]
dtype: object